will-tm/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808dx-pinctrl.h
/* gpio5_uart1_cts */
#define GPIO5_UART1_CTS \
	BFLB_PINMUX(5, uart1, cts, periph)

/* gpio5_uart1_tx */
#define GPIO5_UART1_TX \
	BFLB_PINMUX(5, uart1, tx, periph)

/* gpio5_uart1_rx */
#define GPIO5_UART1_RX \
	BFLB_PINMUX(5, uart1, rx, periph)

/* gpio5_uart2_rts */
#define GPIO5_UART2_RTS \
	BFLB_PINMUX(5, uart2, rts, periph)

/* gpio5_uart2_cts */
#define GPIO5_UART2_CTS \
	BFLB_PINMUX(5, uart2, cts, periph)

/* gpio5_uart2_tx */
#define GPIO5_UART2_TX \
	BFLB_PINMUX(5, uart2, tx, periph)

/* gpio5_uart2_rx */
#define GPIO5_UART2_RX \
	BFLB_PINMUX(5, uart2, rx, periph)

/* gpio5_pwm0_ch1p */
#define GPIO5_PWM0_CH1P \
	BFLB_PINMUX(5, pwm0, ch1p, periph)

/* gpio5_pwm1_ch1p */
#define GPIO5_PWM1_CH1P \
	BFLB_PINMUX(5, pwm1, ch1p, periph)

/* gpio5_spi1_sclk */
#define GPIO5_SPI1_SCLK \
	BFLB_PINMUX(5, spi1, sclk, periph)

/* gpio5_i2c2_sda */
#define GPIO5_I2C2_SDA \
	BFLB_PINMUX(5, i2c2, sda, periph)

/* gpio5_i2c3_sda */
#define GPIO5_I2C3_SDA \
	BFLB_PINMUX(5, i2c3, sda, periph)

/* gpio5_dbi_b_cs */
#define GPIO5_DBI_B_CS \
	BFLB_PINMUX(5, dbi_b, cs, periph)

/* gpio5_dbi_c_cs */
#define GPIO5_DBI_C_CS \
	BFLB_PINMUX(5, dbi_c, cs, periph)

/* gpio5_jtag_lp_tck */
#define GPIO5_JTAG_LP_TCK \
	BFLB_PINMUX(5, jtag_lp, tck, periph)

/* gpio5_jtag_m0_tck */
#define GPIO5_JTAG_M0_TCK \
	BFLB_PINMUX(5, jtag_m0, tck, periph)

/* gpio5_jtag_d0_tck */
#define GPIO5_JTAG_D0_TCK \
	BFLB_PINMUX(5, jtag_d0, tck, periph)

/* gpio5_adc_ch1 */
#define GPIO5_ADC_CH1 \
	BFLB_PINMUX(5, adc, ch1, analog)

/* gpio6_spi0_miso */
#define GPIO6_SPI0_MISO \
	BFLB_PINMUX(6, spi0, miso, periph)

/* gpio6_flash1_d2 */
#define GPIO6_FLASH1_D2 \
	BFLB_PINMUX(6, flash1, d2, periph)

/* gpio6_i2s_di */
#define GPIO6_I2S_DI \
	BFLB_PINMUX(6, i2s, di, periph)

/* gpio6_pdm_clk */
#define GPIO6_PDM_CLK \
	BFLB_PINMUX(6, pdm, clk, periph)

/* gpio6_i2c0_scl */
#define GPIO6_I2C0_SCL \
	BFLB_PINMUX(6, i2c0, scl, periph)

/* gpio6_i2c1_scl */
#define GPIO6_I2C1_SCL \
	BFLB_PINMUX(6, i2c1, scl, periph)

/* gpio6_uart0_rts */
#define GPIO6_UART0_RTS \
	BFLB_PINMUX(6, uart0, rts, periph)

/* gpio6_uart0_cts */
#define GPIO6_UART0_CTS \
	BFLB_PINMUX(6, uart0, cts, periph)

/* gpio6_uart0_tx */
#define GPIO6_UART0_TX \
	BFLB_PINMUX(6, uart0, tx, periph)

/* gpio6_uart0_rx */
#define GPIO6_UART0_RX \
	BFLB_PINMUX(6, uart0, rx, periph)

/* gpio6_uart1_rts */
#define GPIO6_UART1_RTS \
	BFLB_PINMUX(6, uart1, rts, periph)

/* gpio6_uart1_cts */
#define GPIO6_UART1_CTS \
	BFLB_PINMUX(6, uart1, cts, periph)

/* gpio6_uart1_tx */
#define GPIO6_UART1_TX \
	BFLB_PINMUX(6, uart1, tx, periph)

/* gpio6_uart1_rx */
#define GPIO6_UART1_RX \
	BFLB_PINMUX(6, uart1, rx, periph)

/* gpio6_uart2_rts */
#define GPIO6_UART2_RTS \
	BFLB_PINMUX(6, uart2, rts, periph)

/* gpio6_uart2_cts */
#define GPIO6_UART2_CTS \
	BFLB_PINMUX(6, uart2, cts, periph)

/* gpio6_uart2_tx */
#define GPIO6_UART2_TX \
	BFLB_PINMUX(6, uart2, tx, periph)

/* gpio6_uart2_rx */
#define GPIO6_UART2_RX \
	BFLB_PINMUX(6, uart2, rx, periph)

/* gpio6_pwm0_ch2p */
#define GPIO6_PWM0_CH2P \
	BFLB_PINMUX(6, pwm0, ch2p, periph)

/* gpio6_pwm1_ch2p */
#define GPIO6_PWM1_CH2P \
	BFLB_PINMUX(6, pwm1, ch2p, periph)

/* gpio6_spi1_miso */
#define GPIO6_SPI1_MISO \
	BFLB_PINMUX(6, spi1, miso, periph)

/* gpio6_i2c2_scl */
#define GPIO6_I2C2_SCL \
	BFLB_PINMUX(6, i2c2, scl, periph)

/* gpio6_i2c3_scl */
#define GPIO6_I2C3_SCL \
	BFLB_PINMUX(6, i2c3, scl, periph)

/* gpio6_dbi_b_rd */
#define GPIO6_DBI_B_RD \
	BFLB_PINMUX(6, dbi_b, rd, periph)

/* gpio6_dbi_c_sda */
#define GPIO6_DBI_C_SDA \
	BFLB_PINMUX(6, dbi_c, sda, periph)

/* gpio6_jtag_lp_tdo */
#define GPIO6_JTAG_LP_TDO \
	BFLB_PINMUX(6, jtag_lp, tdo, periph)

/* gpio6_jtag_m0_tdo */
#define GPIO6_JTAG_M0_TDO \
	BFLB_PINMUX(6, jtag_m0, tdo, periph)

/* gpio6_jtag_d0_tdo */
#define GPIO6_JTAG_D0_TDO \
	BFLB_PINMUX(6, jtag_d0, tdo, periph)

/* gpio6_adc_ch4 */
#define GPIO6_ADC_CH4 \
	BFLB_PINMUX(6, adc, ch4, analog)

/* gpio7_spi0_mosi */
#define GPIO7_SPI0_MOSI \
	BFLB_PINMUX(7, spi0, mosi, periph)

/* gpio7_flash1_d0 */
#define GPIO7_FLASH1_D0 \
	BFLB_PINMUX(7, flash1, d0, periph)

/* gpio7_i2s_do */
#define GPIO7_I2S_DO \
	BFLB_PINMUX(7, i2s, do, periph)

/* gpio7_pdm_in */
#define GPIO7_PDM_IN \
	BFLB_PINMUX(7, pdm, in, periph)

/* gpio7_i2c0_sda */
#define GPIO7_I2C0_SDA \
	BFLB_PINMUX(7, i2c0, sda, periph)

/* gpio7_i2c1_sda */
#define GPIO7_I2C1_SDA \
	BFLB_PINMUX(7, i2c1, sda, periph)

/* gpio7_uart0_rts */
#define GPIO7_UART0_RTS \
	BFLB_PINMUX(7, uart0, rts, periph)

/* gpio7_uart0_cts */
#define GPIO7_UART0_CTS \
	BFLB_PINMUX(7, uart0, cts, periph)

/* gpio7_uart0_tx */
#define GPIO7_UART0_TX \
	BFLB_PINMUX(7, uart0, tx, periph)

/* gpio7_uart0_rx */
#define GPIO7_UART0_RX \
	BFLB_PINMUX(7, uart0, rx, periph)

/* gpio7_uart1_rts */
#define GPIO7_UART1_RTS \
	BFLB_PINMUX(7, uart1, rts, periph)

/* gpio7_uart1_cts */
#define GPIO7_UART1_CTS \
	BFLB_PINMUX(7, uart1, cts, periph)

/* gpio7_uart1_tx */
#define GPIO7_UART1_TX \
	BFLB_PINMUX(7, uart1, tx, periph)

/* gpio7_uart1_rx */
#define GPIO7_UART1_RX \
	BFLB_PINMUX(7, uart1, rx, periph)

/* gpio7_uart2_rts */
#define GPIO7_UART2_RTS \
	BFLB_PINMUX(7, uart2, rts, periph)

/* gpio7_uart2_cts */
#define GPIO7_UART2_CTS \
	BFLB_PINMUX(7, uart2, cts, periph)

/* gpio7_uart2_tx */
#define GPIO7_UART2_TX \
	BFLB_PINMUX(7, uart2, tx, periph)

/* gpio7_uart2_rx */
#define GPIO7_UART2_RX \
	BFLB_PINMUX(7, uart2, rx, periph)

/* gpio7_pwm0_ch3p */
#define GPIO7_PWM0_CH3P \
	BFLB_PINMUX(7, pwm0, ch3p, periph)

/* gpio7_pwm1_ch3p */
#define GPIO7_PWM1_CH3P \
	BFLB_PINMUX(7, pwm1, ch3p, periph)

/* gpio7_spi1_mosi */
#define GPIO7_SPI1_MOSI \
	BFLB_PINMUX(7, spi1, mosi, periph)

/* gpio7_i2c2_sda */
#define GPIO7_I2C2_SDA \
	BFLB_PINMUX(7, i2c2, sda, periph)

/* gpio7_i2c3_sda */
#define GPIO7_I2C3_SDA \
	BFLB_PINMUX(7, i2c3, sda, periph)

/* gpio7_dbi_b_dc */
#define GPIO7_DBI_B_DC \
	BFLB_PINMUX(7, dbi_b, dc, periph)

/* gpio7_dbi_c_dc */
#define GPIO7_DBI_C_DC \
	BFLB_PINMUX(7, dbi_c, dc, periph)

/* gpio7_jtag_lp_tdi */
#define GPIO7_JTAG_LP_TDI \
	BFLB_PINMUX(7, jtag_lp, tdi, periph)

/* gpio7_jtag_m0_tdi */
#define GPIO7_JTAG_M0_TDI \
	BFLB_PINMUX(7, jtag_m0, tdi, periph)

