will-tm/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808dx-pinctrl.h
/* gpio7_jtag_d0_tdi */
#define GPIO7_JTAG_D0_TDI \
	BFLB_PINMUX(7, jtag_d0, tdi, periph)

/* gpio8_spi0_ss */
#define GPIO8_SPI0_SS \
	BFLB_PINMUX(8, spi0, ss, periph)

/* gpio8_flash1_clk */
#define GPIO8_FLASH1_CLK \
	BFLB_PINMUX(8, flash1, clk, periph)

/* gpio8_i2s_bclk */
#define GPIO8_I2S_BCLK \
	BFLB_PINMUX(8, i2s, bclk, periph)

/* gpio8_pdm_clk */
#define GPIO8_PDM_CLK \
	BFLB_PINMUX(8, pdm, clk, periph)

/* gpio8_i2c0_scl */
#define GPIO8_I2C0_SCL \
	BFLB_PINMUX(8, i2c0, scl, periph)

/* gpio8_i2c1_scl */
#define GPIO8_I2C1_SCL \
	BFLB_PINMUX(8, i2c1, scl, periph)

/* gpio8_uart0_rts */
#define GPIO8_UART0_RTS \
	BFLB_PINMUX(8, uart0, rts, periph)

/* gpio8_uart0_cts */
#define GPIO8_UART0_CTS \
	BFLB_PINMUX(8, uart0, cts, periph)

/* gpio8_uart0_tx */
#define GPIO8_UART0_TX \
	BFLB_PINMUX(8, uart0, tx, periph)

/* gpio8_uart0_rx */
#define GPIO8_UART0_RX \
	BFLB_PINMUX(8, uart0, rx, periph)

/* gpio8_uart1_rts */
#define GPIO8_UART1_RTS \
	BFLB_PINMUX(8, uart1, rts, periph)

/* gpio8_uart1_cts */
#define GPIO8_UART1_CTS \
	BFLB_PINMUX(8, uart1, cts, periph)

/* gpio8_uart1_tx */
#define GPIO8_UART1_TX \
	BFLB_PINMUX(8, uart1, tx, periph)

/* gpio8_uart1_rx */
#define GPIO8_UART1_RX \
	BFLB_PINMUX(8, uart1, rx, periph)

/* gpio8_uart2_rts */
#define GPIO8_UART2_RTS \
	BFLB_PINMUX(8, uart2, rts, periph)

/* gpio8_uart2_cts */
#define GPIO8_UART2_CTS \
	BFLB_PINMUX(8, uart2, cts, periph)

/* gpio8_uart2_tx */
#define GPIO8_UART2_TX \
	BFLB_PINMUX(8, uart2, tx, periph)

/* gpio8_uart2_rx */
#define GPIO8_UART2_RX \
	BFLB_PINMUX(8, uart2, rx, periph)

/* gpio8_pwm0_ch0p */
#define GPIO8_PWM0_CH0P \
	BFLB_PINMUX(8, pwm0, ch0p, periph)

/* gpio8_pwm1_ch0p */
#define GPIO8_PWM1_CH0P \
	BFLB_PINMUX(8, pwm1, ch0p, periph)

/* gpio8_spi1_ss */
#define GPIO8_SPI1_SS \
	BFLB_PINMUX(8, spi1, ss, periph)

/* gpio8_i2c2_scl */
#define GPIO8_I2C2_SCL \
	BFLB_PINMUX(8, i2c2, scl, periph)

/* gpio8_i2c3_scl */
#define GPIO8_I2C3_SCL \
	BFLB_PINMUX(8, i2c3, scl, periph)

/* gpio8_dbi_b_db0 */
#define GPIO8_DBI_B_DB0 \
	BFLB_PINMUX(8, dbi_b, db0, periph)

/* gpio8_dbi_c_scl */
#define GPIO8_DBI_C_SCL \
	BFLB_PINMUX(8, dbi_c, scl, periph)

/* gpio8_jtag_lp_tms */
#define GPIO8_JTAG_LP_TMS \
	BFLB_PINMUX(8, jtag_lp, tms, periph)

/* gpio8_jtag_m0_tms */
#define GPIO8_JTAG_M0_TMS \
	BFLB_PINMUX(8, jtag_m0, tms, periph)

/* gpio8_jtag_d0_tms */
#define GPIO8_JTAG_D0_TMS \
	BFLB_PINMUX(8, jtag_d0, tms, periph)

/* gpio9_spi0_sclk */
#define GPIO9_SPI0_SCLK \
	BFLB_PINMUX(9, spi0, sclk, periph)

/* gpio9_flash1_d3 */
#define GPIO9_FLASH1_D3 \
	BFLB_PINMUX(9, flash1, d3, periph)

/* gpio9_i2s_fs */
#define GPIO9_I2S_FS \
	BFLB_PINMUX(9, i2s, fs, periph)

/* gpio9_pdm_in */
#define GPIO9_PDM_IN \
	BFLB_PINMUX(9, pdm, in, periph)

/* gpio9_i2c0_sda */
#define GPIO9_I2C0_SDA \
	BFLB_PINMUX(9, i2c0, sda, periph)

/* gpio9_i2c1_sda */
#define GPIO9_I2C1_SDA \
	BFLB_PINMUX(9, i2c1, sda, periph)

/* gpio9_uart0_rts */
#define GPIO9_UART0_RTS \
	BFLB_PINMUX(9, uart0, rts, periph)

/* gpio9_uart0_cts */
#define GPIO9_UART0_CTS \
	BFLB_PINMUX(9, uart0, cts, periph)

/* gpio9_uart0_tx */
#define GPIO9_UART0_TX \
	BFLB_PINMUX(9, uart0, tx, periph)

/* gpio9_uart0_rx */
#define GPIO9_UART0_RX \
	BFLB_PINMUX(9, uart0, rx, periph)

/* gpio9_uart1_rts */
#define GPIO9_UART1_RTS \
	BFLB_PINMUX(9, uart1, rts, periph)

/* gpio9_uart1_cts */
#define GPIO9_UART1_CTS \
	BFLB_PINMUX(9, uart1, cts, periph)

/* gpio9_uart1_tx */
#define GPIO9_UART1_TX \
	BFLB_PINMUX(9, uart1, tx, periph)

/* gpio9_uart1_rx */
#define GPIO9_UART1_RX \
	BFLB_PINMUX(9, uart1, rx, periph)

/* gpio9_uart2_rts */
#define GPIO9_UART2_RTS \
	BFLB_PINMUX(9, uart2, rts, periph)

/* gpio9_uart2_cts */
#define GPIO9_UART2_CTS \
	BFLB_PINMUX(9, uart2, cts, periph)

/* gpio9_uart2_tx */
#define GPIO9_UART2_TX \
	BFLB_PINMUX(9, uart2, tx, periph)

/* gpio9_uart2_rx */
#define GPIO9_UART2_RX \
	BFLB_PINMUX(9, uart2, rx, periph)

/* gpio9_pwm0_ch1p */
#define GPIO9_PWM0_CH1P \
	BFLB_PINMUX(9, pwm0, ch1p, periph)

/* gpio9_pwm1_ch1p */
#define GPIO9_PWM1_CH1P \
	BFLB_PINMUX(9, pwm1, ch1p, periph)

/* gpio9_spi1_sclk */
#define GPIO9_SPI1_SCLK \
	BFLB_PINMUX(9, spi1, sclk, periph)

/* gpio9_i2c2_sda */
#define GPIO9_I2C2_SDA \
	BFLB_PINMUX(9, i2c2, sda, periph)

/* gpio9_i2c3_sda */
#define GPIO9_I2C3_SDA \
	BFLB_PINMUX(9, i2c3, sda, periph)

/* gpio9_dbi_b_db1 */
#define GPIO9_DBI_B_DB1 \
	BFLB_PINMUX(9, dbi_b, db1, periph)

/* gpio9_dbi_c_cs */
#define GPIO9_DBI_C_CS \
	BFLB_PINMUX(9, dbi_c, cs, periph)

/* gpio9_jtag_lp_tck */
#define GPIO9_JTAG_LP_TCK \
	BFLB_PINMUX(9, jtag_lp, tck, periph)

/* gpio9_jtag_m0_tck */
#define GPIO9_JTAG_M0_TCK \
	BFLB_PINMUX(9, jtag_m0, tck, periph)

/* gpio9_jtag_d0_tck */
#define GPIO9_JTAG_D0_TCK \
	BFLB_PINMUX(9, jtag_d0, tck, periph)

/* gpio10_spi0_miso */
#define GPIO10_SPI0_MISO \
	BFLB_PINMUX(10, spi0, miso, periph)

/* gpio10_flash1_d3 */
#define GPIO10_FLASH1_D3 \
	BFLB_PINMUX(10, flash1, d3, periph)

/* gpio10_i2s_di */
#define GPIO10_I2S_DI \
	BFLB_PINMUX(10, i2s, di, periph)

/* gpio10_pdm_clk */
#define GPIO10_PDM_CLK \
	BFLB_PINMUX(10, pdm, clk, periph)

/* gpio10_i2c0_scl */
#define GPIO10_I2C0_SCL \
	BFLB_PINMUX(10, i2c0, scl, periph)

/* gpio10_i2c1_scl */
#define GPIO10_I2C1_SCL \
	BFLB_PINMUX(10, i2c1, scl, periph)

/* gpio10_uart0_rts */
#define GPIO10_UART0_RTS \
	BFLB_PINMUX(10, uart0, rts, periph)

/* gpio10_uart0_cts */
#define GPIO10_UART0_CTS \
	BFLB_PINMUX(10, uart0, cts, periph)

/* gpio10_uart0_tx */
#define GPIO10_UART0_TX \
	BFLB_PINMUX(10, uart0, tx, periph)

/* gpio10_uart0_rx */
#define GPIO10_UART0_RX \
	BFLB_PINMUX(10, uart0, rx, periph)

/* gpio10_uart1_rts */
#define GPIO10_UART1_RTS \
	BFLB_PINMUX(10, uart1, rts, periph)

/* gpio10_uart1_cts */
#define GPIO10_UART1_CTS \
	BFLB_PINMUX(10, uart1, cts, periph)

/* gpio10_uart1_tx */
#define GPIO10_UART1_TX \
	BFLB_PINMUX(10, uart1, tx, periph)

/* gpio10_uart1_rx */
#define GPIO10_UART1_RX \
	BFLB_PINMUX(10, uart1, rx, periph)

/* gpio10_uart2_rts */
#define GPIO10_UART2_RTS \
	BFLB_PINMUX(10, uart2, rts, periph)

/* gpio10_uart2_cts */
#define GPIO10_UART2_CTS \
	BFLB_PINMUX(10, uart2, cts, periph)

/* gpio10_uart2_tx */
#define GPIO10_UART2_TX \
	BFLB_PINMUX(10, uart2, tx, periph)

/* gpio10_uart2_rx */
#define GPIO10_UART2_RX \
	BFLB_PINMUX(10, uart2, rx, periph)

/* gpio10_cam1_dat1 */
#define GPIO10_CAM1_DAT1 \
	BFLB_PINMUX(10, cam1, dat1, periph)

/* gpio10_pwm0_ch2p */
#define GPIO10_PWM0_CH2P \
	BFLB_PINMUX(10, pwm0, ch2p, periph)

