will-tm/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808dx-pinctrl.h
/* gpio10_pwm1_ch2p */
#define GPIO10_PWM1_CH2P \
	BFLB_PINMUX(10, pwm1, ch2p, periph)

/* gpio10_spi1_miso */
#define GPIO10_SPI1_MISO \
	BFLB_PINMUX(10, spi1, miso, periph)

/* gpio10_i2c2_scl */
#define GPIO10_I2C2_SCL \
	BFLB_PINMUX(10, i2c2, scl, periph)

/* gpio10_i2c3_scl */
#define GPIO10_I2C3_SCL \
	BFLB_PINMUX(10, i2c3, scl, periph)

/* gpio10_dbi_b_db2 */
#define GPIO10_DBI_B_DB2 \
	BFLB_PINMUX(10, dbi_b, db2, periph)

/* gpio10_dbi_c_sda */
#define GPIO10_DBI_C_SDA \
	BFLB_PINMUX(10, dbi_c, sda, periph)

/* gpio10_jtag_lp_tdo */
#define GPIO10_JTAG_LP_TDO \
	BFLB_PINMUX(10, jtag_lp, tdo, periph)

/* gpio10_jtag_m0_tdo */
#define GPIO10_JTAG_M0_TDO \
	BFLB_PINMUX(10, jtag_m0, tdo, periph)

/* gpio10_jtag_d0_tdo */
#define GPIO10_JTAG_D0_TDO \
	BFLB_PINMUX(10, jtag_d0, tdo, periph)

/* gpio11_spi0_mosi */
#define GPIO11_SPI0_MOSI \
	BFLB_PINMUX(11, spi0, mosi, periph)

/* gpio11_flash2_clk */
#define GPIO11_FLASH2_CLK \
	BFLB_PINMUX(11, flash2, clk, periph)

/* gpio11_i2s_do */
#define GPIO11_I2S_DO \
	BFLB_PINMUX(11, i2s, do, periph)

/* gpio11_pdm_in */
#define GPIO11_PDM_IN \
	BFLB_PINMUX(11, pdm, in, periph)

/* gpio11_i2c0_sda */
#define GPIO11_I2C0_SDA \
	BFLB_PINMUX(11, i2c0, sda, periph)

/* gpio11_i2c1_sda */
#define GPIO11_I2C1_SDA \
	BFLB_PINMUX(11, i2c1, sda, periph)

/* gpio11_uart0_rts */
#define GPIO11_UART0_RTS \
	BFLB_PINMUX(11, uart0, rts, periph)

/* gpio11_uart0_cts */
#define GPIO11_UART0_CTS \
	BFLB_PINMUX(11, uart0, cts, periph)

/* gpio11_uart0_tx */
#define GPIO11_UART0_TX \
	BFLB_PINMUX(11, uart0, tx, periph)

/* gpio11_uart0_rx */
#define GPIO11_UART0_RX \
	BFLB_PINMUX(11, uart0, rx, periph)

/* gpio11_uart1_rts */
#define GPIO11_UART1_RTS \
	BFLB_PINMUX(11, uart1, rts, periph)

/* gpio11_uart1_cts */
#define GPIO11_UART1_CTS \
	BFLB_PINMUX(11, uart1, cts, periph)

/* gpio11_uart1_tx */
#define GPIO11_UART1_TX \
	BFLB_PINMUX(11, uart1, tx, periph)

/* gpio11_uart1_rx */
#define GPIO11_UART1_RX \
	BFLB_PINMUX(11, uart1, rx, periph)

/* gpio11_uart2_rts */
#define GPIO11_UART2_RTS \
	BFLB_PINMUX(11, uart2, rts, periph)

/* gpio11_uart2_cts */
#define GPIO11_UART2_CTS \
	BFLB_PINMUX(11, uart2, cts, periph)

/* gpio11_uart2_tx */
#define GPIO11_UART2_TX \
	BFLB_PINMUX(11, uart2, tx, periph)

/* gpio11_uart2_rx */
#define GPIO11_UART2_RX \
	BFLB_PINMUX(11, uart2, rx, periph)

/* gpio11_cam1_dat2 */
#define GPIO11_CAM1_DAT2 \
	BFLB_PINMUX(11, cam1, dat2, periph)

/* gpio11_pwm0_ch3p */
#define GPIO11_PWM0_CH3P \
	BFLB_PINMUX(11, pwm0, ch3p, periph)

/* gpio11_pwm1_ch3p */
#define GPIO11_PWM1_CH3P \
	BFLB_PINMUX(11, pwm1, ch3p, periph)

/* gpio11_spi1_mosi */
#define GPIO11_SPI1_MOSI \
	BFLB_PINMUX(11, spi1, mosi, periph)

/* gpio11_i2c2_sda */
#define GPIO11_I2C2_SDA \
	BFLB_PINMUX(11, i2c2, sda, periph)

/* gpio11_i2c3_sda */
#define GPIO11_I2C3_SDA \
	BFLB_PINMUX(11, i2c3, sda, periph)

/* gpio11_dbi_b_db3 */
#define GPIO11_DBI_B_DB3 \
	BFLB_PINMUX(11, dbi_b, db3, periph)

/* gpio11_dbi_c_dc */
#define GPIO11_DBI_C_DC \
	BFLB_PINMUX(11, dbi_c, dc, periph)

/* gpio11_jtag_lp_tdi */
#define GPIO11_JTAG_LP_TDI \
	BFLB_PINMUX(11, jtag_lp, tdi, periph)

/* gpio11_jtag_m0_tdi */
#define GPIO11_JTAG_M0_TDI \
	BFLB_PINMUX(11, jtag_m0, tdi, periph)

/* gpio11_jtag_d0_tdi */
#define GPIO11_JTAG_D0_TDI \
	BFLB_PINMUX(11, jtag_d0, tdi, periph)

/* gpio11_adc_ch3 */
#define GPIO11_ADC_CH3 \
	BFLB_PINMUX(11, adc, ch3, analog)

/* gpio11_dac_cha */
#define GPIO11_DAC_CHA \
	BFLB_PINMUX(11, dac, cha, analog)

/* gpio12_spi0_ss */
#define GPIO12_SPI0_SS \
	BFLB_PINMUX(12, spi0, ss, periph)

/* gpio12_flash2_d0 */
#define GPIO12_FLASH2_D0 \
	BFLB_PINMUX(12, flash2, d0, periph)

/* gpio12_i2s_bclk */
#define GPIO12_I2S_BCLK \
	BFLB_PINMUX(12, i2s, bclk, periph)

/* gpio12_pdm_clk */
#define GPIO12_PDM_CLK \
	BFLB_PINMUX(12, pdm, clk, periph)

/* gpio12_i2c0_scl */
#define GPIO12_I2C0_SCL \
	BFLB_PINMUX(12, i2c0, scl, periph)

/* gpio12_i2c1_scl */
#define GPIO12_I2C1_SCL \
	BFLB_PINMUX(12, i2c1, scl, periph)

/* gpio12_uart0_rts */
#define GPIO12_UART0_RTS \
	BFLB_PINMUX(12, uart0, rts, periph)

/* gpio12_uart0_cts */
#define GPIO12_UART0_CTS \
	BFLB_PINMUX(12, uart0, cts, periph)

/* gpio12_uart0_tx */
#define GPIO12_UART0_TX \
	BFLB_PINMUX(12, uart0, tx, periph)

/* gpio12_uart0_rx */
#define GPIO12_UART0_RX \
	BFLB_PINMUX(12, uart0, rx, periph)

/* gpio12_uart1_rts */
#define GPIO12_UART1_RTS \
	BFLB_PINMUX(12, uart1, rts, periph)

/* gpio12_uart1_cts */
#define GPIO12_UART1_CTS \
	BFLB_PINMUX(12, uart1, cts, periph)

/* gpio12_uart1_tx */
#define GPIO12_UART1_TX \
	BFLB_PINMUX(12, uart1, tx, periph)

/* gpio12_uart1_rx */
#define GPIO12_UART1_RX \
	BFLB_PINMUX(12, uart1, rx, periph)

/* gpio12_uart2_rts */
#define GPIO12_UART2_RTS \
	BFLB_PINMUX(12, uart2, rts, periph)

/* gpio12_uart2_cts */
#define GPIO12_UART2_CTS \
	BFLB_PINMUX(12, uart2, cts, periph)

/* gpio12_uart2_tx */
#define GPIO12_UART2_TX \
	BFLB_PINMUX(12, uart2, tx, periph)

/* gpio12_uart2_rx */
#define GPIO12_UART2_RX \
	BFLB_PINMUX(12, uart2, rx, periph)

/* gpio12_cam1_dat3 */
#define GPIO12_CAM1_DAT3 \
	BFLB_PINMUX(12, cam1, dat3, periph)

/* gpio12_pwm0_ch0p */
#define GPIO12_PWM0_CH0P \
	BFLB_PINMUX(12, pwm0, ch0p, periph)

/* gpio12_pwm1_ch0p */
#define GPIO12_PWM1_CH0P \
	BFLB_PINMUX(12, pwm1, ch0p, periph)

/* gpio12_spi1_ss */
#define GPIO12_SPI1_SS \
	BFLB_PINMUX(12, spi1, ss, periph)

/* gpio12_i2c2_scl */
#define GPIO12_I2C2_SCL \
	BFLB_PINMUX(12, i2c2, scl, periph)

/* gpio12_i2c3_scl */
#define GPIO12_I2C3_SCL \
	BFLB_PINMUX(12, i2c3, scl, periph)

/* gpio12_dbi_b_db4 */
#define GPIO12_DBI_B_DB4 \
	BFLB_PINMUX(12, dbi_b, db4, periph)

/* gpio12_dbi_c_scl */
#define GPIO12_DBI_C_SCL \
	BFLB_PINMUX(12, dbi_c, scl, periph)

/* gpio12_jtag_lp_tms */
#define GPIO12_JTAG_LP_TMS \
	BFLB_PINMUX(12, jtag_lp, tms, periph)

/* gpio12_jtag_m0_tms */
#define GPIO12_JTAG_M0_TMS \
	BFLB_PINMUX(12, jtag_m0, tms, periph)

/* gpio12_jtag_d0_tms */
#define GPIO12_JTAG_D0_TMS \
	BFLB_PINMUX(12, jtag_d0, tms, periph)

/* gpio12_adc_ch6 */
#define GPIO12_ADC_CH6 \
	BFLB_PINMUX(12, adc, ch6, analog)

