will-tm/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808dx-pinctrl.h
/* gpio13_spi0_sclk */
#define GPIO13_SPI0_SCLK \
	BFLB_PINMUX(13, spi0, sclk, periph)

/* gpio13_flash2_d2 */
#define GPIO13_FLASH2_D2 \
	BFLB_PINMUX(13, flash2, d2, periph)

/* gpio13_i2s_fs */
#define GPIO13_I2S_FS \
	BFLB_PINMUX(13, i2s, fs, periph)

/* gpio13_pdm_in */
#define GPIO13_PDM_IN \
	BFLB_PINMUX(13, pdm, in, periph)

/* gpio13_i2c0_sda */
#define GPIO13_I2C0_SDA \
	BFLB_PINMUX(13, i2c0, sda, periph)

/* gpio13_i2c1_sda */
#define GPIO13_I2C1_SDA \
	BFLB_PINMUX(13, i2c1, sda, periph)

/* gpio13_uart0_rts */
#define GPIO13_UART0_RTS \
	BFLB_PINMUX(13, uart0, rts, periph)

/* gpio13_uart0_cts */
#define GPIO13_UART0_CTS \
	BFLB_PINMUX(13, uart0, cts, periph)

/* gpio13_uart0_tx */
#define GPIO13_UART0_TX \
	BFLB_PINMUX(13, uart0, tx, periph)

/* gpio13_uart0_rx */
#define GPIO13_UART0_RX \
	BFLB_PINMUX(13, uart0, rx, periph)

/* gpio13_uart1_rts */
#define GPIO13_UART1_RTS \
	BFLB_PINMUX(13, uart1, rts, periph)

/* gpio13_uart1_cts */
#define GPIO13_UART1_CTS \
	BFLB_PINMUX(13, uart1, cts, periph)

/* gpio13_uart1_tx */
#define GPIO13_UART1_TX \
	BFLB_PINMUX(13, uart1, tx, periph)

/* gpio13_uart1_rx */
#define GPIO13_UART1_RX \
	BFLB_PINMUX(13, uart1, rx, periph)

/* gpio13_uart2_rts */
#define GPIO13_UART2_RTS \
	BFLB_PINMUX(13, uart2, rts, periph)

/* gpio13_uart2_cts */
#define GPIO13_UART2_CTS \
	BFLB_PINMUX(13, uart2, cts, periph)

/* gpio13_uart2_tx */
#define GPIO13_UART2_TX \
	BFLB_PINMUX(13, uart2, tx, periph)

/* gpio13_uart2_rx */
#define GPIO13_UART2_RX \
	BFLB_PINMUX(13, uart2, rx, periph)

/* gpio13_cam1_clk */
#define GPIO13_CAM1_CLK \
	BFLB_PINMUX(13, cam1, clk, periph)

/* gpio13_pwm0_ch1p */
#define GPIO13_PWM0_CH1P \
	BFLB_PINMUX(13, pwm0, ch1p, periph)

/* gpio13_pwm1_ch1p */
#define GPIO13_PWM1_CH1P \
	BFLB_PINMUX(13, pwm1, ch1p, periph)

/* gpio13_spi1_sclk */
#define GPIO13_SPI1_SCLK \
	BFLB_PINMUX(13, spi1, sclk, periph)

/* gpio13_i2c2_sda */
#define GPIO13_I2C2_SDA \
	BFLB_PINMUX(13, i2c2, sda, periph)

/* gpio13_i2c3_sda */
#define GPIO13_I2C3_SDA \
	BFLB_PINMUX(13, i2c3, sda, periph)

/* gpio13_dbi_b_db5 */
#define GPIO13_DBI_B_DB5 \
	BFLB_PINMUX(13, dbi_b, db5, periph)

/* gpio13_dbi_c_cs */
#define GPIO13_DBI_C_CS \
	BFLB_PINMUX(13, dbi_c, cs, periph)

/* gpio13_jtag_lp_tck */
#define GPIO13_JTAG_LP_TCK \
	BFLB_PINMUX(13, jtag_lp, tck, periph)

/* gpio13_jtag_m0_tck */
#define GPIO13_JTAG_M0_TCK \
	BFLB_PINMUX(13, jtag_m0, tck, periph)

/* gpio13_jtag_d0_tck */
#define GPIO13_JTAG_D0_TCK \
	BFLB_PINMUX(13, jtag_d0, tck, periph)

/* gpio13_adc_ch7 */
#define GPIO13_ADC_CH7 \
	BFLB_PINMUX(13, adc, ch7, analog)

/* gpio14_spi0_miso */
#define GPIO14_SPI0_MISO \
	BFLB_PINMUX(14, spi0, miso, periph)

/* gpio14_flash2_d1 */
#define GPIO14_FLASH2_D1 \
	BFLB_PINMUX(14, flash2, d1, periph)

/* gpio14_i2s_di */
#define GPIO14_I2S_DI \
	BFLB_PINMUX(14, i2s, di, periph)

/* gpio14_pdm_clk */
#define GPIO14_PDM_CLK \
	BFLB_PINMUX(14, pdm, clk, periph)

/* gpio14_i2c0_scl */
#define GPIO14_I2C0_SCL \
	BFLB_PINMUX(14, i2c0, scl, periph)

/* gpio14_i2c1_scl */
#define GPIO14_I2C1_SCL \
	BFLB_PINMUX(14, i2c1, scl, periph)

/* gpio14_uart0_rts */
#define GPIO14_UART0_RTS \
	BFLB_PINMUX(14, uart0, rts, periph)

/* gpio14_uart0_cts */
#define GPIO14_UART0_CTS \
	BFLB_PINMUX(14, uart0, cts, periph)

/* gpio14_uart0_tx */
#define GPIO14_UART0_TX \
	BFLB_PINMUX(14, uart0, tx, periph)

/* gpio14_uart0_rx */
#define GPIO14_UART0_RX \
	BFLB_PINMUX(14, uart0, rx, periph)

/* gpio14_uart1_rts */
#define GPIO14_UART1_RTS \
	BFLB_PINMUX(14, uart1, rts, periph)

/* gpio14_uart1_cts */
#define GPIO14_UART1_CTS \
	BFLB_PINMUX(14, uart1, cts, periph)

/* gpio14_uart1_tx */
#define GPIO14_UART1_TX \
	BFLB_PINMUX(14, uart1, tx, periph)

/* gpio14_uart1_rx */
#define GPIO14_UART1_RX \
	BFLB_PINMUX(14, uart1, rx, periph)

/* gpio14_uart2_rts */
#define GPIO14_UART2_RTS \
	BFLB_PINMUX(14, uart2, rts, periph)

/* gpio14_uart2_cts */
#define GPIO14_UART2_CTS \
	BFLB_PINMUX(14, uart2, cts, periph)

/* gpio14_uart2_tx */
#define GPIO14_UART2_TX \
	BFLB_PINMUX(14, uart2, tx, periph)

/* gpio14_uart2_rx */
#define GPIO14_UART2_RX \
	BFLB_PINMUX(14, uart2, rx, periph)

/* gpio14_cam1_dat4 */
#define GPIO14_CAM1_DAT4 \
	BFLB_PINMUX(14, cam1, dat4, periph)

/* gpio14_pwm0_ch2p */
#define GPIO14_PWM0_CH2P \
	BFLB_PINMUX(14, pwm0, ch2p, periph)

/* gpio14_pwm1_ch2p */
#define GPIO14_PWM1_CH2P \
	BFLB_PINMUX(14, pwm1, ch2p, periph)

/* gpio14_spi1_miso */
#define GPIO14_SPI1_MISO \
	BFLB_PINMUX(14, spi1, miso, periph)

/* gpio14_i2c2_scl */
#define GPIO14_I2C2_SCL \
	BFLB_PINMUX(14, i2c2, scl, periph)

/* gpio14_i2c3_scl */
#define GPIO14_I2C3_SCL \
	BFLB_PINMUX(14, i2c3, scl, periph)

/* gpio14_dbi_b_db6 */
#define GPIO14_DBI_B_DB6 \
	BFLB_PINMUX(14, dbi_b, db6, periph)

/* gpio14_dbi_c_sda */
#define GPIO14_DBI_C_SDA \
	BFLB_PINMUX(14, dbi_c, sda, periph)

/* gpio14_jtag_lp_tdo */
#define GPIO14_JTAG_LP_TDO \
	BFLB_PINMUX(14, jtag_lp, tdo, periph)

/* gpio14_jtag_m0_tdo */
#define GPIO14_JTAG_M0_TDO \
	BFLB_PINMUX(14, jtag_m0, tdo, periph)

/* gpio14_jtag_d0_tdo */
#define GPIO14_JTAG_D0_TDO \
	BFLB_PINMUX(14, jtag_d0, tdo, periph)

/* gpio15_spi0_mosi */
#define GPIO15_SPI0_MOSI \
	BFLB_PINMUX(15, spi0, mosi, periph)

/* gpio15_flash2_cs */
#define GPIO15_FLASH2_CS \
	BFLB_PINMUX(15, flash2, cs, periph)

/* gpio15_i2s_do */
#define GPIO15_I2S_DO \
	BFLB_PINMUX(15, i2s, do, periph)

/* gpio15_pdm_in */
#define GPIO15_PDM_IN \
	BFLB_PINMUX(15, pdm, in, periph)

/* gpio15_i2c0_sda */
#define GPIO15_I2C0_SDA \
	BFLB_PINMUX(15, i2c0, sda, periph)

/* gpio15_i2c1_sda */
#define GPIO15_I2C1_SDA \
	BFLB_PINMUX(15, i2c1, sda, periph)

/* gpio15_uart0_rts */
#define GPIO15_UART0_RTS \
	BFLB_PINMUX(15, uart0, rts, periph)

/* gpio15_uart0_cts */
#define GPIO15_UART0_CTS \
	BFLB_PINMUX(15, uart0, cts, periph)

/* gpio15_uart0_tx */
#define GPIO15_UART0_TX \
	BFLB_PINMUX(15, uart0, tx, periph)

/* gpio15_uart0_rx */
#define GPIO15_UART0_RX \
	BFLB_PINMUX(15, uart0, rx, periph)

/* gpio15_uart1_rts */
#define GPIO15_UART1_RTS \
	BFLB_PINMUX(15, uart1, rts, periph)

/* gpio15_uart1_cts */
#define GPIO15_UART1_CTS \
	BFLB_PINMUX(15, uart1, cts, periph)

