will-tm/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808dx-pinctrl.h
/* gpio20_spi1_ss */
#define GPIO20_SPI1_SS \
	BFLB_PINMUX(20, spi1, ss, periph)

/* gpio20_i2c2_scl */
#define GPIO20_I2C2_SCL \
	BFLB_PINMUX(20, i2c2, scl, periph)

/* gpio20_i2c3_scl */
#define GPIO20_I2C3_SCL \
	BFLB_PINMUX(20, i2c3, scl, periph)

/* gpio20_jtag_lp_tms */
#define GPIO20_JTAG_LP_TMS \
	BFLB_PINMUX(20, jtag_lp, tms, periph)

/* gpio20_jtag_m0_tms */
#define GPIO20_JTAG_M0_TMS \
	BFLB_PINMUX(20, jtag_m0, tms, periph)

/* gpio20_jtag_d0_tms */
#define GPIO20_JTAG_D0_TMS \
	BFLB_PINMUX(20, jtag_d0, tms, periph)

/* gpio21_spi0_sclk */
#define GPIO21_SPI0_SCLK \
	BFLB_PINMUX(21, spi0, sclk, periph)

/* gpio21_i2s_fs */
#define GPIO21_I2S_FS \
	BFLB_PINMUX(21, i2s, fs, periph)

/* gpio21_pdm_in */
#define GPIO21_PDM_IN \
	BFLB_PINMUX(21, pdm, in, periph)

/* gpio21_i2c0_sda */
#define GPIO21_I2C0_SDA \
	BFLB_PINMUX(21, i2c0, sda, periph)

/* gpio21_i2c1_sda */
#define GPIO21_I2C1_SDA \
	BFLB_PINMUX(21, i2c1, sda, periph)

/* gpio21_uart0_rts */
#define GPIO21_UART0_RTS \
	BFLB_PINMUX(21, uart0, rts, periph)

/* gpio21_uart0_cts */
#define GPIO21_UART0_CTS \
	BFLB_PINMUX(21, uart0, cts, periph)

/* gpio21_uart0_tx */
#define GPIO21_UART0_TX \
	BFLB_PINMUX(21, uart0, tx, periph)

/* gpio21_uart0_rx */
#define GPIO21_UART0_RX \
	BFLB_PINMUX(21, uart0, rx, periph)

/* gpio21_uart1_rts */
#define GPIO21_UART1_RTS \
	BFLB_PINMUX(21, uart1, rts, periph)

/* gpio21_uart1_cts */
#define GPIO21_UART1_CTS \
	BFLB_PINMUX(21, uart1, cts, periph)

/* gpio21_uart1_tx */
#define GPIO21_UART1_TX \
	BFLB_PINMUX(21, uart1, tx, periph)

/* gpio21_uart1_rx */
#define GPIO21_UART1_RX \
	BFLB_PINMUX(21, uart1, rx, periph)

/* gpio21_uart2_rts */
#define GPIO21_UART2_RTS \
	BFLB_PINMUX(21, uart2, rts, periph)

/* gpio21_uart2_cts */
#define GPIO21_UART2_CTS \
	BFLB_PINMUX(21, uart2, cts, periph)

/* gpio21_uart2_tx */
#define GPIO21_UART2_TX \
	BFLB_PINMUX(21, uart2, tx, periph)

/* gpio21_uart2_rx */
#define GPIO21_UART2_RX \
	BFLB_PINMUX(21, uart2, rx, periph)

/* gpio21_pwm0_ch1p */
#define GPIO21_PWM0_CH1P \
	BFLB_PINMUX(21, pwm0, ch1p, periph)

/* gpio21_pwm1_ch1p */
#define GPIO21_PWM1_CH1P \
	BFLB_PINMUX(21, pwm1, ch1p, periph)

/* gpio21_spi1_sclk */
#define GPIO21_SPI1_SCLK \
	BFLB_PINMUX(21, spi1, sclk, periph)

/* gpio21_i2c2_sda */
#define GPIO21_I2C2_SDA \
	BFLB_PINMUX(21, i2c2, sda, periph)

/* gpio21_i2c3_sda */
#define GPIO21_I2C3_SDA \
	BFLB_PINMUX(21, i2c3, sda, periph)

/* gpio21_jtag_lp_tck */
#define GPIO21_JTAG_LP_TCK \
	BFLB_PINMUX(21, jtag_lp, tck, periph)

/* gpio21_jtag_m0_tck */
#define GPIO21_JTAG_M0_TCK \
	BFLB_PINMUX(21, jtag_m0, tck, periph)

/* gpio21_jtag_d0_tck */
#define GPIO21_JTAG_D0_TCK \
	BFLB_PINMUX(21, jtag_d0, tck, periph)

/* gpio22_spi0_miso */
#define GPIO22_SPI0_MISO \
	BFLB_PINMUX(22, spi0, miso, periph)

/* gpio22_i2s_di */
#define GPIO22_I2S_DI \
	BFLB_PINMUX(22, i2s, di, periph)

/* gpio22_pdm_clk */
#define GPIO22_PDM_CLK \
	BFLB_PINMUX(22, pdm, clk, periph)

/* gpio22_i2c0_scl */
#define GPIO22_I2C0_SCL \
	BFLB_PINMUX(22, i2c0, scl, periph)

/* gpio22_i2c1_scl */
#define GPIO22_I2C1_SCL \
	BFLB_PINMUX(22, i2c1, scl, periph)

/* gpio22_uart0_rts */
#define GPIO22_UART0_RTS \
	BFLB_PINMUX(22, uart0, rts, periph)

/* gpio22_uart0_cts */
#define GPIO22_UART0_CTS \
	BFLB_PINMUX(22, uart0, cts, periph)

/* gpio22_uart0_tx */
#define GPIO22_UART0_TX \
	BFLB_PINMUX(22, uart0, tx, periph)

/* gpio22_uart0_rx */
#define GPIO22_UART0_RX \
	BFLB_PINMUX(22, uart0, rx, periph)

/* gpio22_uart1_rts */
#define GPIO22_UART1_RTS \
	BFLB_PINMUX(22, uart1, rts, periph)

/* gpio22_uart1_cts */
#define GPIO22_UART1_CTS \
	BFLB_PINMUX(22, uart1, cts, periph)

/* gpio22_uart1_tx */
#define GPIO22_UART1_TX \
	BFLB_PINMUX(22, uart1, tx, periph)

/* gpio22_uart1_rx */
#define GPIO22_UART1_RX \
	BFLB_PINMUX(22, uart1, rx, periph)

/* gpio22_uart2_rts */
#define GPIO22_UART2_RTS \
	BFLB_PINMUX(22, uart2, rts, periph)

/* gpio22_uart2_cts */
#define GPIO22_UART2_CTS \
	BFLB_PINMUX(22, uart2, cts, periph)

/* gpio22_uart2_tx */
#define GPIO22_UART2_TX \
	BFLB_PINMUX(22, uart2, tx, periph)

/* gpio22_uart2_rx */
#define GPIO22_UART2_RX \
	BFLB_PINMUX(22, uart2, rx, periph)

/* gpio22_pwm0_ch2p */
#define GPIO22_PWM0_CH2P \
	BFLB_PINMUX(22, pwm0, ch2p, periph)

/* gpio22_pwm1_ch2p */
#define GPIO22_PWM1_CH2P \
	BFLB_PINMUX(22, pwm1, ch2p, periph)

/* gpio22_spi1_miso */
#define GPIO22_SPI1_MISO \
	BFLB_PINMUX(22, spi1, miso, periph)

/* gpio22_i2c2_scl */
#define GPIO22_I2C2_SCL \
	BFLB_PINMUX(22, i2c2, scl, periph)

/* gpio22_i2c3_scl */
#define GPIO22_I2C3_SCL \
	BFLB_PINMUX(22, i2c3, scl, periph)

/* gpio22_jtag_lp_tdo */
#define GPIO22_JTAG_LP_TDO \
	BFLB_PINMUX(22, jtag_lp, tdo, periph)

/* gpio22_jtag_m0_tdo */
#define GPIO22_JTAG_M0_TDO \
	BFLB_PINMUX(22, jtag_m0, tdo, periph)

/* gpio22_jtag_d0_tdo */
#define GPIO22_JTAG_D0_TDO \
	BFLB_PINMUX(22, jtag_d0, tdo, periph)

/* gpio23_spi0_mosi */
#define GPIO23_SPI0_MOSI \
	BFLB_PINMUX(23, spi0, mosi, periph)

/* gpio23_i2s_do */
#define GPIO23_I2S_DO \
	BFLB_PINMUX(23, i2s, do, periph)

/* gpio23_pdm_in */
#define GPIO23_PDM_IN \
	BFLB_PINMUX(23, pdm, in, periph)

/* gpio23_i2c0_sda */
#define GPIO23_I2C0_SDA \
	BFLB_PINMUX(23, i2c0, sda, periph)

/* gpio23_i2c1_sda */
#define GPIO23_I2C1_SDA \
	BFLB_PINMUX(23, i2c1, sda, periph)

/* gpio23_uart0_rts */
#define GPIO23_UART0_RTS \
	BFLB_PINMUX(23, uart0, rts, periph)

/* gpio23_uart0_cts */
#define GPIO23_UART0_CTS \
	BFLB_PINMUX(23, uart0, cts, periph)

/* gpio23_uart0_tx */
#define GPIO23_UART0_TX \
	BFLB_PINMUX(23, uart0, tx, periph)

/* gpio23_uart0_rx */
#define GPIO23_UART0_RX \
	BFLB_PINMUX(23, uart0, rx, periph)

/* gpio23_uart1_rts */
#define GPIO23_UART1_RTS \
	BFLB_PINMUX(23, uart1, rts, periph)

/* gpio23_uart1_cts */
#define GPIO23_UART1_CTS \
	BFLB_PINMUX(23, uart1, cts, periph)

/* gpio23_uart1_tx */
#define GPIO23_UART1_TX \
	BFLB_PINMUX(23, uart1, tx, periph)

/* gpio23_uart1_rx */
#define GPIO23_UART1_RX \
	BFLB_PINMUX(23, uart1, rx, periph)

/* gpio23_uart2_rts */
#define GPIO23_UART2_RTS \
	BFLB_PINMUX(23, uart2, rts, periph)

/* gpio23_uart2_cts */
#define GPIO23_UART2_CTS \
	BFLB_PINMUX(23, uart2, cts, periph)

/* gpio23_uart2_tx */
#define GPIO23_UART2_TX \
	BFLB_PINMUX(23, uart2, tx, periph)

/* gpio23_uart2_rx */
#define GPIO23_UART2_RX \
	BFLB_PINMUX(23, uart2, rx, periph)

/* gpio23_pwm0_ch3p */
#define GPIO23_PWM0_CH3P \
	BFLB_PINMUX(23, pwm0, ch3p, periph)

/* gpio23_pwm1_ch3p */
#define GPIO23_PWM1_CH3P \
	BFLB_PINMUX(23, pwm1, ch3p, periph)

/* gpio23_spi1_mosi */
#define GPIO23_SPI1_MOSI \
	BFLB_PINMUX(23, spi1, mosi, periph)

/* gpio23_i2c2_sda */
#define GPIO23_I2C2_SDA \
	BFLB_PINMUX(23, i2c2, sda, periph)

/* gpio23_i2c3_sda */
#define GPIO23_I2C3_SDA \
	BFLB_PINMUX(23, i2c3, sda, periph)

