will-tm/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808dx-pinctrl.h
/* gpio26_uart2_rts */
#define GPIO26_UART2_RTS \
	BFLB_PINMUX(26, uart2, rts, periph)

/* gpio26_uart2_cts */
#define GPIO26_UART2_CTS \
	BFLB_PINMUX(26, uart2, cts, periph)

/* gpio26_uart2_tx */
#define GPIO26_UART2_TX \
	BFLB_PINMUX(26, uart2, tx, periph)

/* gpio26_uart2_rx */
#define GPIO26_UART2_RX \
	BFLB_PINMUX(26, uart2, rx, periph)

/* gpio26_emac_txd1 */
#define GPIO26_EMAC_TXD1 \
	BFLB_PINMUX(26, emac, txd1, periph)

/* gpio26_cam0_dat2 */
#define GPIO26_CAM0_DAT2 \
	BFLB_PINMUX(26, cam0, dat2, periph)

/* gpio26_pwm0_ch2p */
#define GPIO26_PWM0_CH2P \
	BFLB_PINMUX(26, pwm0, ch2p, periph)

/* gpio26_pwm1_ch2p */
#define GPIO26_PWM1_CH2P \
	BFLB_PINMUX(26, pwm1, ch2p, periph)

/* gpio26_spi1_miso */
#define GPIO26_SPI1_MISO \
	BFLB_PINMUX(26, spi1, miso, periph)

/* gpio26_i2c2_scl */
#define GPIO26_I2C2_SCL \
	BFLB_PINMUX(26, i2c2, scl, periph)

/* gpio26_i2c3_scl */
#define GPIO26_I2C3_SCL \
	BFLB_PINMUX(26, i2c3, scl, periph)

/* gpio26_jtag_lp_tdo */
#define GPIO26_JTAG_LP_TDO \
	BFLB_PINMUX(26, jtag_lp, tdo, periph)

/* gpio26_jtag_m0_tdo */
#define GPIO26_JTAG_M0_TDO \
	BFLB_PINMUX(26, jtag_m0, tdo, periph)

/* gpio26_jtag_d0_tdo */
#define GPIO26_JTAG_D0_TDO \
	BFLB_PINMUX(26, jtag_d0, tdo, periph)

/* gpio27_spi0_mosi */
#define GPIO27_SPI0_MOSI \
	BFLB_PINMUX(27, spi0, mosi, periph)

/* gpio27_i2s_do */
#define GPIO27_I2S_DO \
	BFLB_PINMUX(27, i2s, do, periph)

/* gpio27_pdm_in */
#define GPIO27_PDM_IN \
	BFLB_PINMUX(27, pdm, in, periph)

/* gpio27_i2c0_sda */
#define GPIO27_I2C0_SDA \
	BFLB_PINMUX(27, i2c0, sda, periph)

/* gpio27_i2c1_sda */
#define GPIO27_I2C1_SDA \
	BFLB_PINMUX(27, i2c1, sda, periph)

/* gpio27_uart0_rts */
#define GPIO27_UART0_RTS \
	BFLB_PINMUX(27, uart0, rts, periph)

/* gpio27_uart0_cts */
#define GPIO27_UART0_CTS \
	BFLB_PINMUX(27, uart0, cts, periph)

/* gpio27_uart0_tx */
#define GPIO27_UART0_TX \
	BFLB_PINMUX(27, uart0, tx, periph)

/* gpio27_uart0_rx */
#define GPIO27_UART0_RX \
	BFLB_PINMUX(27, uart0, rx, periph)

/* gpio27_uart1_rts */
#define GPIO27_UART1_RTS \
	BFLB_PINMUX(27, uart1, rts, periph)

/* gpio27_uart1_cts */
#define GPIO27_UART1_CTS \
	BFLB_PINMUX(27, uart1, cts, periph)

/* gpio27_uart1_tx */
#define GPIO27_UART1_TX \
	BFLB_PINMUX(27, uart1, tx, periph)

/* gpio27_uart1_rx */
#define GPIO27_UART1_RX \
	BFLB_PINMUX(27, uart1, rx, periph)

/* gpio27_uart2_rts */
#define GPIO27_UART2_RTS \
	BFLB_PINMUX(27, uart2, rts, periph)

/* gpio27_uart2_cts */
#define GPIO27_UART2_CTS \
	BFLB_PINMUX(27, uart2, cts, periph)

/* gpio27_uart2_tx */
#define GPIO27_UART2_TX \
	BFLB_PINMUX(27, uart2, tx, periph)

/* gpio27_uart2_rx */
#define GPIO27_UART2_RX \
	BFLB_PINMUX(27, uart2, rx, periph)

/* gpio27_emac_rx_dv */
#define GPIO27_EMAC_RX_DV \
	BFLB_PINMUX(27, emac, rx_dv, periph)

/* gpio27_cam0_dat3 */
#define GPIO27_CAM0_DAT3 \
	BFLB_PINMUX(27, cam0, dat3, periph)

/* gpio27_pwm0_ch3p */
#define GPIO27_PWM0_CH3P \
	BFLB_PINMUX(27, pwm0, ch3p, periph)

/* gpio27_pwm1_ch3p */
#define GPIO27_PWM1_CH3P \
	BFLB_PINMUX(27, pwm1, ch3p, periph)

/* gpio27_spi1_mosi */
#define GPIO27_SPI1_MOSI \
	BFLB_PINMUX(27, spi1, mosi, periph)

/* gpio27_i2c2_sda */
#define GPIO27_I2C2_SDA \
	BFLB_PINMUX(27, i2c2, sda, periph)

/* gpio27_i2c3_sda */
#define GPIO27_I2C3_SDA \
	BFLB_PINMUX(27, i2c3, sda, periph)

/* gpio27_jtag_lp_tdi */
#define GPIO27_JTAG_LP_TDI \
	BFLB_PINMUX(27, jtag_lp, tdi, periph)

/* gpio27_jtag_m0_tdi */
#define GPIO27_JTAG_M0_TDI \
	BFLB_PINMUX(27, jtag_m0, tdi, periph)

/* gpio27_jtag_d0_tdi */
#define GPIO27_JTAG_D0_TDI \
	BFLB_PINMUX(27, jtag_d0, tdi, periph)

/* gpio28_spi0_ss */
#define GPIO28_SPI0_SS \
	BFLB_PINMUX(28, spi0, ss, periph)

/* gpio28_i2s_bclk */
#define GPIO28_I2S_BCLK \
	BFLB_PINMUX(28, i2s, bclk, periph)

/* gpio28_pdm_clk */
#define GPIO28_PDM_CLK \
	BFLB_PINMUX(28, pdm, clk, periph)

/* gpio28_i2c0_scl */
#define GPIO28_I2C0_SCL \
	BFLB_PINMUX(28, i2c0, scl, periph)

/* gpio28_i2c1_scl */
#define GPIO28_I2C1_SCL \
	BFLB_PINMUX(28, i2c1, scl, periph)

/* gpio28_uart0_rts */
#define GPIO28_UART0_RTS \
	BFLB_PINMUX(28, uart0, rts, periph)

/* gpio28_uart0_cts */
#define GPIO28_UART0_CTS \
	BFLB_PINMUX(28, uart0, cts, periph)

/* gpio28_uart0_tx */
#define GPIO28_UART0_TX \
	BFLB_PINMUX(28, uart0, tx, periph)

/* gpio28_uart0_rx */
#define GPIO28_UART0_RX \
	BFLB_PINMUX(28, uart0, rx, periph)

/* gpio28_uart1_rts */
#define GPIO28_UART1_RTS \
	BFLB_PINMUX(28, uart1, rts, periph)

/* gpio28_uart1_cts */
#define GPIO28_UART1_CTS \
	BFLB_PINMUX(28, uart1, cts, periph)

/* gpio28_uart1_tx */
#define GPIO28_UART1_TX \
	BFLB_PINMUX(28, uart1, tx, periph)

/* gpio28_uart1_rx */
#define GPIO28_UART1_RX \
	BFLB_PINMUX(28, uart1, rx, periph)

/* gpio28_uart2_rts */
#define GPIO28_UART2_RTS \
	BFLB_PINMUX(28, uart2, rts, periph)

/* gpio28_uart2_cts */
#define GPIO28_UART2_CTS \
	BFLB_PINMUX(28, uart2, cts, periph)

/* gpio28_uart2_tx */
#define GPIO28_UART2_TX \
	BFLB_PINMUX(28, uart2, tx, periph)

/* gpio28_uart2_rx */
#define GPIO28_UART2_RX \
	BFLB_PINMUX(28, uart2, rx, periph)

/* gpio28_emac_rxd0 */
#define GPIO28_EMAC_RXD0 \
	BFLB_PINMUX(28, emac, rxd0, periph)

/* gpio28_cam0_hsync */
#define GPIO28_CAM0_HSYNC \
	BFLB_PINMUX(28, cam0, hsync, periph)

/* gpio28_pwm0_ch0p */
#define GPIO28_PWM0_CH0P \
	BFLB_PINMUX(28, pwm0, ch0p, periph)

/* gpio28_pwm1_ch0p */
#define GPIO28_PWM1_CH0P \
	BFLB_PINMUX(28, pwm1, ch0p, periph)

/* gpio28_spi1_ss */
#define GPIO28_SPI1_SS \
	BFLB_PINMUX(28, spi1, ss, periph)

/* gpio28_i2c2_scl */
#define GPIO28_I2C2_SCL \
	BFLB_PINMUX(28, i2c2, scl, periph)

/* gpio28_i2c3_scl */
#define GPIO28_I2C3_SCL \
	BFLB_PINMUX(28, i2c3, scl, periph)

/* gpio28_jtag_lp_tms */
#define GPIO28_JTAG_LP_TMS \
	BFLB_PINMUX(28, jtag_lp, tms, periph)

/* gpio28_jtag_m0_tms */
#define GPIO28_JTAG_M0_TMS \
	BFLB_PINMUX(28, jtag_m0, tms, periph)

/* gpio28_jtag_d0_tms */
#define GPIO28_JTAG_D0_TMS \
	BFLB_PINMUX(28, jtag_d0, tms, periph)

/* gpio29_spi0_sclk */
#define GPIO29_SPI0_SCLK \
	BFLB_PINMUX(29, spi0, sclk, periph)

/* gpio29_i2s_fs */
#define GPIO29_I2S_FS \
	BFLB_PINMUX(29, i2s, fs, periph)

/* gpio29_pdm_in */
#define GPIO29_PDM_IN \
	BFLB_PINMUX(29, pdm, in, periph)

