will-tm/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808dx-pinctrl.h
/* gpio29_i2c0_sda */
#define GPIO29_I2C0_SDA \
	BFLB_PINMUX(29, i2c0, sda, periph)

/* gpio29_i2c1_sda */
#define GPIO29_I2C1_SDA \
	BFLB_PINMUX(29, i2c1, sda, periph)

/* gpio29_uart0_rts */
#define GPIO29_UART0_RTS \
	BFLB_PINMUX(29, uart0, rts, periph)

/* gpio29_uart0_cts */
#define GPIO29_UART0_CTS \
	BFLB_PINMUX(29, uart0, cts, periph)

/* gpio29_uart0_tx */
#define GPIO29_UART0_TX \
	BFLB_PINMUX(29, uart0, tx, periph)

/* gpio29_uart0_rx */
#define GPIO29_UART0_RX \
	BFLB_PINMUX(29, uart0, rx, periph)

/* gpio29_uart1_rts */
#define GPIO29_UART1_RTS \
	BFLB_PINMUX(29, uart1, rts, periph)

/* gpio29_uart1_cts */
#define GPIO29_UART1_CTS \
	BFLB_PINMUX(29, uart1, cts, periph)

/* gpio29_uart1_tx */
#define GPIO29_UART1_TX \
	BFLB_PINMUX(29, uart1, tx, periph)

/* gpio29_uart1_rx */
#define GPIO29_UART1_RX \
	BFLB_PINMUX(29, uart1, rx, periph)

/* gpio29_uart2_rts */
#define GPIO29_UART2_RTS \
	BFLB_PINMUX(29, uart2, rts, periph)

/* gpio29_uart2_cts */
#define GPIO29_UART2_CTS \
	BFLB_PINMUX(29, uart2, cts, periph)

/* gpio29_uart2_tx */
#define GPIO29_UART2_TX \
	BFLB_PINMUX(29, uart2, tx, periph)

/* gpio29_uart2_rx */
#define GPIO29_UART2_RX \
	BFLB_PINMUX(29, uart2, rx, periph)

/* gpio29_emac_rxd1 */
#define GPIO29_EMAC_RXD1 \
	BFLB_PINMUX(29, emac, rxd1, periph)

/* gpio29_cam0_vsync */
#define GPIO29_CAM0_VSYNC \
	BFLB_PINMUX(29, cam0, vsync, periph)

/* gpio29_pwm0_ch1p */
#define GPIO29_PWM0_CH1P \
	BFLB_PINMUX(29, pwm0, ch1p, periph)

/* gpio29_pwm1_ch1p */
#define GPIO29_PWM1_CH1P \
	BFLB_PINMUX(29, pwm1, ch1p, periph)

/* gpio29_spi1_sclk */
#define GPIO29_SPI1_SCLK \
	BFLB_PINMUX(29, spi1, sclk, periph)

/* gpio29_i2c2_sda */
#define GPIO29_I2C2_SDA \
	BFLB_PINMUX(29, i2c2, sda, periph)

/* gpio29_i2c3_sda */
#define GPIO29_I2C3_SDA \
	BFLB_PINMUX(29, i2c3, sda, periph)

/* gpio29_jtag_lp_tck */
#define GPIO29_JTAG_LP_TCK \
	BFLB_PINMUX(29, jtag_lp, tck, periph)

/* gpio29_jtag_m0_tck */
#define GPIO29_JTAG_M0_TCK \
	BFLB_PINMUX(29, jtag_m0, tck, periph)

/* gpio29_jtag_d0_tck */
#define GPIO29_JTAG_D0_TCK \
	BFLB_PINMUX(29, jtag_d0, tck, periph)

/* gpio30_spi0_miso */
#define GPIO30_SPI0_MISO \
	BFLB_PINMUX(30, spi0, miso, periph)

/* gpio30_i2s_di */
#define GPIO30_I2S_DI \
	BFLB_PINMUX(30, i2s, di, periph)

/* gpio30_pdm_clk */
#define GPIO30_PDM_CLK \
	BFLB_PINMUX(30, pdm, clk, periph)

/* gpio30_i2c0_scl */
#define GPIO30_I2C0_SCL \
	BFLB_PINMUX(30, i2c0, scl, periph)

/* gpio30_i2c1_scl */
#define GPIO30_I2C1_SCL \
	BFLB_PINMUX(30, i2c1, scl, periph)

/* gpio30_uart0_rts */
#define GPIO30_UART0_RTS \
	BFLB_PINMUX(30, uart0, rts, periph)

/* gpio30_uart0_cts */
#define GPIO30_UART0_CTS \
	BFLB_PINMUX(30, uart0, cts, periph)

/* gpio30_uart0_tx */
#define GPIO30_UART0_TX \
	BFLB_PINMUX(30, uart0, tx, periph)

/* gpio30_uart0_rx */
#define GPIO30_UART0_RX \
	BFLB_PINMUX(30, uart0, rx, periph)

/* gpio30_uart1_rts */
#define GPIO30_UART1_RTS \
	BFLB_PINMUX(30, uart1, rts, periph)

/* gpio30_uart1_cts */
#define GPIO30_UART1_CTS \
	BFLB_PINMUX(30, uart1, cts, periph)

/* gpio30_uart1_tx */
#define GPIO30_UART1_TX \
	BFLB_PINMUX(30, uart1, tx, periph)

/* gpio30_uart1_rx */
#define GPIO30_UART1_RX \
	BFLB_PINMUX(30, uart1, rx, periph)

/* gpio30_uart2_rts */
#define GPIO30_UART2_RTS \
	BFLB_PINMUX(30, uart2, rts, periph)

/* gpio30_uart2_cts */
#define GPIO30_UART2_CTS \
	BFLB_PINMUX(30, uart2, cts, periph)

/* gpio30_uart2_tx */
#define GPIO30_UART2_TX \
	BFLB_PINMUX(30, uart2, tx, periph)

/* gpio30_uart2_rx */
#define GPIO30_UART2_RX \
	BFLB_PINMUX(30, uart2, rx, periph)

/* gpio30_emac_rxerr */
#define GPIO30_EMAC_RXERR \
	BFLB_PINMUX(30, emac, rxerr, periph)

/* gpio30_pwm0_ch2p */
#define GPIO30_PWM0_CH2P \
	BFLB_PINMUX(30, pwm0, ch2p, periph)

/* gpio30_pwm1_ch2p */
#define GPIO30_PWM1_CH2P \
	BFLB_PINMUX(30, pwm1, ch2p, periph)

/* gpio30_spi1_miso */
#define GPIO30_SPI1_MISO \
	BFLB_PINMUX(30, spi1, miso, periph)

/* gpio30_i2c2_scl */
#define GPIO30_I2C2_SCL \
	BFLB_PINMUX(30, i2c2, scl, periph)

/* gpio30_i2c3_scl */
#define GPIO30_I2C3_SCL \
	BFLB_PINMUX(30, i2c3, scl, periph)

/* gpio30_jtag_lp_tdo */
#define GPIO30_JTAG_LP_TDO \
	BFLB_PINMUX(30, jtag_lp, tdo, periph)

/* gpio30_jtag_m0_tdo */
#define GPIO30_JTAG_M0_TDO \
	BFLB_PINMUX(30, jtag_m0, tdo, periph)

/* gpio30_jtag_d0_tdo */
#define GPIO30_JTAG_D0_TDO \
	BFLB_PINMUX(30, jtag_d0, tdo, periph)

/* gpio31_spi0_mosi */
#define GPIO31_SPI0_MOSI \
	BFLB_PINMUX(31, spi0, mosi, periph)

/* gpio31_i2s_do */
#define GPIO31_I2S_DO \
	BFLB_PINMUX(31, i2s, do, periph)

/* gpio31_pdm_in */
#define GPIO31_PDM_IN \
	BFLB_PINMUX(31, pdm, in, periph)

/* gpio31_i2c0_sda */
#define GPIO31_I2C0_SDA \
	BFLB_PINMUX(31, i2c0, sda, periph)

/* gpio31_i2c1_sda */
#define GPIO31_I2C1_SDA \
	BFLB_PINMUX(31, i2c1, sda, periph)

/* gpio31_uart0_rts */
#define GPIO31_UART0_RTS \
	BFLB_PINMUX(31, uart0, rts, periph)

/* gpio31_uart0_cts */
#define GPIO31_UART0_CTS \
	BFLB_PINMUX(31, uart0, cts, periph)

/* gpio31_uart0_tx */
#define GPIO31_UART0_TX \
	BFLB_PINMUX(31, uart0, tx, periph)

/* gpio31_uart0_rx */
#define GPIO31_UART0_RX \
	BFLB_PINMUX(31, uart0, rx, periph)

/* gpio31_uart1_rts */
#define GPIO31_UART1_RTS \
	BFLB_PINMUX(31, uart1, rts, periph)

/* gpio31_uart1_cts */
#define GPIO31_UART1_CTS \
	BFLB_PINMUX(31, uart1, cts, periph)

/* gpio31_uart1_tx */
#define GPIO31_UART1_TX \
	BFLB_PINMUX(31, uart1, tx, periph)

/* gpio31_uart1_rx */
#define GPIO31_UART1_RX \
	BFLB_PINMUX(31, uart1, rx, periph)

/* gpio31_uart2_rts */
#define GPIO31_UART2_RTS \
	BFLB_PINMUX(31, uart2, rts, periph)

/* gpio31_uart2_cts */
#define GPIO31_UART2_CTS \
	BFLB_PINMUX(31, uart2, cts, periph)

/* gpio31_uart2_tx */
#define GPIO31_UART2_TX \
	BFLB_PINMUX(31, uart2, tx, periph)

/* gpio31_uart2_rx */
#define GPIO31_UART2_RX \
	BFLB_PINMUX(31, uart2, rx, periph)

/* gpio31_emac_tx_en */
#define GPIO31_EMAC_TX_EN \
	BFLB_PINMUX(31, emac, tx_en, periph)

/* gpio31_cam0_dat4 */
#define GPIO31_CAM0_DAT4 \
	BFLB_PINMUX(31, cam0, dat4, periph)

