will-tm/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808dx-pinctrl.h
/* gpio31_pwm0_ch3p */
#define GPIO31_PWM0_CH3P \
	BFLB_PINMUX(31, pwm0, ch3p, periph)

/* gpio31_pwm1_ch3p */
#define GPIO31_PWM1_CH3P \
	BFLB_PINMUX(31, pwm1, ch3p, periph)

/* gpio31_spi1_mosi */
#define GPIO31_SPI1_MOSI \
	BFLB_PINMUX(31, spi1, mosi, periph)

/* gpio31_i2c2_sda */
#define GPIO31_I2C2_SDA \
	BFLB_PINMUX(31, i2c2, sda, periph)

/* gpio31_i2c3_sda */
#define GPIO31_I2C3_SDA \
	BFLB_PINMUX(31, i2c3, sda, periph)

/* gpio31_jtag_lp_tdi */
#define GPIO31_JTAG_LP_TDI \
	BFLB_PINMUX(31, jtag_lp, tdi, periph)

/* gpio31_jtag_m0_tdi */
#define GPIO31_JTAG_M0_TDI \
	BFLB_PINMUX(31, jtag_m0, tdi, periph)

/* gpio31_jtag_d0_tdi */
#define GPIO31_JTAG_D0_TDI \
	BFLB_PINMUX(31, jtag_d0, tdi, periph)

/* gpio32_spi0_ss */
#define GPIO32_SPI0_SS \
	BFLB_PINMUX(32, spi0, ss, periph)

/* gpio32_i2s_bclk */
#define GPIO32_I2S_BCLK \
	BFLB_PINMUX(32, i2s, bclk, periph)

/* gpio32_pdm_clk */
#define GPIO32_PDM_CLK \
	BFLB_PINMUX(32, pdm, clk, periph)

/* gpio32_i2c0_scl */
#define GPIO32_I2C0_SCL \
	BFLB_PINMUX(32, i2c0, scl, periph)

/* gpio32_i2c1_scl */
#define GPIO32_I2C1_SCL \
	BFLB_PINMUX(32, i2c1, scl, periph)

/* gpio32_uart0_rts */
#define GPIO32_UART0_RTS \
	BFLB_PINMUX(32, uart0, rts, periph)

/* gpio32_uart0_cts */
#define GPIO32_UART0_CTS \
	BFLB_PINMUX(32, uart0, cts, periph)

/* gpio32_uart0_tx */
#define GPIO32_UART0_TX \
	BFLB_PINMUX(32, uart0, tx, periph)

/* gpio32_uart0_rx */
#define GPIO32_UART0_RX \
	BFLB_PINMUX(32, uart0, rx, periph)

/* gpio32_uart1_rts */
#define GPIO32_UART1_RTS \
	BFLB_PINMUX(32, uart1, rts, periph)

/* gpio32_uart1_cts */
#define GPIO32_UART1_CTS \
	BFLB_PINMUX(32, uart1, cts, periph)

/* gpio32_uart1_tx */
#define GPIO32_UART1_TX \
	BFLB_PINMUX(32, uart1, tx, periph)

/* gpio32_uart1_rx */
#define GPIO32_UART1_RX \
	BFLB_PINMUX(32, uart1, rx, periph)

/* gpio32_uart2_rts */
#define GPIO32_UART2_RTS \
	BFLB_PINMUX(32, uart2, rts, periph)

/* gpio32_uart2_cts */
#define GPIO32_UART2_CTS \
	BFLB_PINMUX(32, uart2, cts, periph)

/* gpio32_uart2_tx */
#define GPIO32_UART2_TX \
	BFLB_PINMUX(32, uart2, tx, periph)

/* gpio32_uart2_rx */
#define GPIO32_UART2_RX \
	BFLB_PINMUX(32, uart2, rx, periph)

/* gpio32_emac_rx_dv */
#define GPIO32_EMAC_RX_DV \
	BFLB_PINMUX(32, emac, rx_dv, periph)

/* gpio32_cam0_dat5 */
#define GPIO32_CAM0_DAT5 \
	BFLB_PINMUX(32, cam0, dat5, periph)

/* gpio32_pwm0_ch0p */
#define GPIO32_PWM0_CH0P \
	BFLB_PINMUX(32, pwm0, ch0p, periph)

/* gpio32_pwm1_ch0p */
#define GPIO32_PWM1_CH0P \
	BFLB_PINMUX(32, pwm1, ch0p, periph)

/* gpio32_spi1_ss */
#define GPIO32_SPI1_SS \
	BFLB_PINMUX(32, spi1, ss, periph)

/* gpio32_i2c2_scl */
#define GPIO32_I2C2_SCL \
	BFLB_PINMUX(32, i2c2, scl, periph)

/* gpio32_i2c3_scl */
#define GPIO32_I2C3_SCL \
	BFLB_PINMUX(32, i2c3, scl, periph)

/* gpio32_jtag_lp_tms */
#define GPIO32_JTAG_LP_TMS \
	BFLB_PINMUX(32, jtag_lp, tms, periph)

/* gpio32_jtag_m0_tms */
#define GPIO32_JTAG_M0_TMS \
	BFLB_PINMUX(32, jtag_m0, tms, periph)

/* gpio32_jtag_d0_tms */
#define GPIO32_JTAG_D0_TMS \
	BFLB_PINMUX(32, jtag_d0, tms, periph)

/* gpio33_spi0_sclk */
#define GPIO33_SPI0_SCLK \
	BFLB_PINMUX(33, spi0, sclk, periph)

/* gpio33_i2s_fs */
#define GPIO33_I2S_FS \
	BFLB_PINMUX(33, i2s, fs, periph)

/* gpio33_pdm_in */
#define GPIO33_PDM_IN \
	BFLB_PINMUX(33, pdm, in, periph)

/* gpio33_i2c0_sda */
#define GPIO33_I2C0_SDA \
	BFLB_PINMUX(33, i2c0, sda, periph)

/* gpio33_i2c1_sda */
#define GPIO33_I2C1_SDA \
	BFLB_PINMUX(33, i2c1, sda, periph)

/* gpio33_uart0_rts */
#define GPIO33_UART0_RTS \
	BFLB_PINMUX(33, uart0, rts, periph)

/* gpio33_uart0_cts */
#define GPIO33_UART0_CTS \
	BFLB_PINMUX(33, uart0, cts, periph)

/* gpio33_uart0_tx */
#define GPIO33_UART0_TX \
	BFLB_PINMUX(33, uart0, tx, periph)

/* gpio33_uart0_rx */
#define GPIO33_UART0_RX \
	BFLB_PINMUX(33, uart0, rx, periph)

/* gpio33_uart1_rts */
#define GPIO33_UART1_RTS \
	BFLB_PINMUX(33, uart1, rts, periph)

/* gpio33_uart1_cts */
#define GPIO33_UART1_CTS \
	BFLB_PINMUX(33, uart1, cts, periph)

/* gpio33_uart1_tx */
#define GPIO33_UART1_TX \
	BFLB_PINMUX(33, uart1, tx, periph)

/* gpio33_uart1_rx */
#define GPIO33_UART1_RX \
	BFLB_PINMUX(33, uart1, rx, periph)

/* gpio33_uart2_rts */
#define GPIO33_UART2_RTS \
	BFLB_PINMUX(33, uart2, rts, periph)

/* gpio33_uart2_cts */
#define GPIO33_UART2_CTS \
	BFLB_PINMUX(33, uart2, cts, periph)

/* gpio33_uart2_tx */
#define GPIO33_UART2_TX \
	BFLB_PINMUX(33, uart2, tx, periph)

/* gpio33_uart2_rx */
#define GPIO33_UART2_RX \
	BFLB_PINMUX(33, uart2, rx, periph)

/* gpio33_emac_mdc */
#define GPIO33_EMAC_MDC \
	BFLB_PINMUX(33, emac, mdc, periph)

/* gpio33_cam0_dat6 */
#define GPIO33_CAM0_DAT6 \
	BFLB_PINMUX(33, cam0, dat6, periph)

/* gpio33_pwm0_ch1p */
#define GPIO33_PWM0_CH1P \
	BFLB_PINMUX(33, pwm0, ch1p, periph)

/* gpio33_pwm1_ch1p */
#define GPIO33_PWM1_CH1P \
	BFLB_PINMUX(33, pwm1, ch1p, periph)

/* gpio33_spi1_sclk */
#define GPIO33_SPI1_SCLK \
	BFLB_PINMUX(33, spi1, sclk, periph)

/* gpio33_i2c2_sda */
#define GPIO33_I2C2_SDA \
	BFLB_PINMUX(33, i2c2, sda, periph)

/* gpio33_i2c3_sda */
#define GPIO33_I2C3_SDA \
	BFLB_PINMUX(33, i2c3, sda, periph)

/* gpio33_jtag_lp_tck */
#define GPIO33_JTAG_LP_TCK \
	BFLB_PINMUX(33, jtag_lp, tck, periph)

/* gpio33_jtag_m0_tck */
#define GPIO33_JTAG_M0_TCK \
	BFLB_PINMUX(33, jtag_m0, tck, periph)

/* gpio33_jtag_d0_tck */
#define GPIO33_JTAG_D0_TCK \
	BFLB_PINMUX(33, jtag_d0, tck, periph)

/* gpio34_spi0_miso */
#define GPIO34_SPI0_MISO \
	BFLB_PINMUX(34, spi0, miso, periph)

/* gpio34_i2s_di */
#define GPIO34_I2S_DI \
	BFLB_PINMUX(34, i2s, di, periph)

/* gpio34_pdm_clk */
#define GPIO34_PDM_CLK \
	BFLB_PINMUX(34, pdm, clk, periph)

/* gpio34_i2c0_scl */
#define GPIO34_I2C0_SCL \
	BFLB_PINMUX(34, i2c0, scl, periph)

/* gpio34_i2c1_scl */
#define GPIO34_I2C1_SCL \
	BFLB_PINMUX(34, i2c1, scl, periph)

/* gpio34_uart0_rts */
#define GPIO34_UART0_RTS \
	BFLB_PINMUX(34, uart0, rts, periph)

/* gpio34_uart0_cts */
#define GPIO34_UART0_CTS \
	BFLB_PINMUX(34, uart0, cts, periph)

