will-tm/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808dx-pinctrl.h
/* gpio40_i2s_bclk */
#define GPIO40_I2S_BCLK \
	BFLB_PINMUX(40, i2s, bclk, periph)

/* gpio40_pdm_clk */
#define GPIO40_PDM_CLK \
	BFLB_PINMUX(40, pdm, clk, periph)

/* gpio40_i2c0_scl */
#define GPIO40_I2C0_SCL \
	BFLB_PINMUX(40, i2c0, scl, periph)

/* gpio40_i2c1_scl */
#define GPIO40_I2C1_SCL \
	BFLB_PINMUX(40, i2c1, scl, periph)

/* gpio40_uart0_rts */
#define GPIO40_UART0_RTS \
	BFLB_PINMUX(40, uart0, rts, periph)

/* gpio40_uart0_cts */
#define GPIO40_UART0_CTS \
	BFLB_PINMUX(40, uart0, cts, periph)

/* gpio40_uart0_tx */
#define GPIO40_UART0_TX \
	BFLB_PINMUX(40, uart0, tx, periph)

/* gpio40_uart0_rx */
#define GPIO40_UART0_RX \
	BFLB_PINMUX(40, uart0, rx, periph)

/* gpio40_uart1_rts */
#define GPIO40_UART1_RTS \
	BFLB_PINMUX(40, uart1, rts, periph)

/* gpio40_uart1_cts */
#define GPIO40_UART1_CTS \
	BFLB_PINMUX(40, uart1, cts, periph)

/* gpio40_uart1_tx */
#define GPIO40_UART1_TX \
	BFLB_PINMUX(40, uart1, tx, periph)

/* gpio40_uart1_rx */
#define GPIO40_UART1_RX \
	BFLB_PINMUX(40, uart1, rx, periph)

/* gpio40_uart2_rts */
#define GPIO40_UART2_RTS \
	BFLB_PINMUX(40, uart2, rts, periph)

/* gpio40_uart2_cts */
#define GPIO40_UART2_CTS \
	BFLB_PINMUX(40, uart2, cts, periph)

/* gpio40_uart2_tx */
#define GPIO40_UART2_TX \
	BFLB_PINMUX(40, uart2, tx, periph)

/* gpio40_uart2_rx */
#define GPIO40_UART2_RX \
	BFLB_PINMUX(40, uart2, rx, periph)

/* gpio40_pwm0_ch0p */
#define GPIO40_PWM0_CH0P \
	BFLB_PINMUX(40, pwm0, ch0p, periph)

/* gpio40_pwm1_ch0p */
#define GPIO40_PWM1_CH0P \
	BFLB_PINMUX(40, pwm1, ch0p, periph)

/* gpio40_spi1_ss */
#define GPIO40_SPI1_SS \
	BFLB_PINMUX(40, spi1, ss, periph)

/* gpio40_i2c2_scl */
#define GPIO40_I2C2_SCL \
	BFLB_PINMUX(40, i2c2, scl, periph)

/* gpio40_i2c3_scl */
#define GPIO40_I2C3_SCL \
	BFLB_PINMUX(40, i2c3, scl, periph)

/* gpio40_jtag_lp_tms */
#define GPIO40_JTAG_LP_TMS \
	BFLB_PINMUX(40, jtag_lp, tms, periph)

/* gpio40_jtag_m0_tms */
#define GPIO40_JTAG_M0_TMS \
	BFLB_PINMUX(40, jtag_m0, tms, periph)

/* gpio40_jtag_d0_tms */
#define GPIO40_JTAG_D0_TMS \
	BFLB_PINMUX(40, jtag_d0, tms, periph)

/* gpio40_adc_ch5 */
#define GPIO40_ADC_CH5 \
	BFLB_PINMUX(40, adc, ch5, analog)

/* gpio41_spi0_sclk */
#define GPIO41_SPI0_SCLK \
	BFLB_PINMUX(41, spi0, sclk, periph)

/* gpio41_i2s_fs */
#define GPIO41_I2S_FS \
	BFLB_PINMUX(41, i2s, fs, periph)

/* gpio41_pdm_in */
#define GPIO41_PDM_IN \
	BFLB_PINMUX(41, pdm, in, periph)

/* gpio41_i2c0_sda */
#define GPIO41_I2C0_SDA \
	BFLB_PINMUX(41, i2c0, sda, periph)

/* gpio41_i2c1_sda */
#define GPIO41_I2C1_SDA \
	BFLB_PINMUX(41, i2c1, sda, periph)

/* gpio41_uart0_rts */
#define GPIO41_UART0_RTS \
	BFLB_PINMUX(41, uart0, rts, periph)

/* gpio41_uart0_cts */
#define GPIO41_UART0_CTS \
	BFLB_PINMUX(41, uart0, cts, periph)

/* gpio41_uart0_tx */
#define GPIO41_UART0_TX \
	BFLB_PINMUX(41, uart0, tx, periph)

/* gpio41_uart0_rx */
#define GPIO41_UART0_RX \
	BFLB_PINMUX(41, uart0, rx, periph)

/* gpio41_uart1_rts */
#define GPIO41_UART1_RTS \
	BFLB_PINMUX(41, uart1, rts, periph)

/* gpio41_uart1_cts */
#define GPIO41_UART1_CTS \
	BFLB_PINMUX(41, uart1, cts, periph)

/* gpio41_uart1_tx */
#define GPIO41_UART1_TX \
	BFLB_PINMUX(41, uart1, tx, periph)

/* gpio41_uart1_rx */
#define GPIO41_UART1_RX \
	BFLB_PINMUX(41, uart1, rx, periph)

/* gpio41_uart2_rts */
#define GPIO41_UART2_RTS \
	BFLB_PINMUX(41, uart2, rts, periph)

/* gpio41_uart2_cts */
#define GPIO41_UART2_CTS \
	BFLB_PINMUX(41, uart2, cts, periph)

/* gpio41_uart2_tx */
#define GPIO41_UART2_TX \
	BFLB_PINMUX(41, uart2, tx, periph)

/* gpio41_uart2_rx */
#define GPIO41_UART2_RX \
	BFLB_PINMUX(41, uart2, rx, periph)

/* gpio41_pwm0_ch1p */
#define GPIO41_PWM0_CH1P \
	BFLB_PINMUX(41, pwm0, ch1p, periph)

/* gpio41_pwm1_ch1p */
#define GPIO41_PWM1_CH1P \
	BFLB_PINMUX(41, pwm1, ch1p, periph)

/* gpio41_spi1_sclk */
#define GPIO41_SPI1_SCLK \
	BFLB_PINMUX(41, spi1, sclk, periph)

/* gpio41_i2c2_sda */
#define GPIO41_I2C2_SDA \
	BFLB_PINMUX(41, i2c2, sda, periph)

/* gpio41_i2c3_sda */
#define GPIO41_I2C3_SDA \
	BFLB_PINMUX(41, i2c3, sda, periph)

/* gpio41_jtag_lp_tck */
#define GPIO41_JTAG_LP_TCK \
	BFLB_PINMUX(41, jtag_lp, tck, periph)

/* gpio41_jtag_m0_tck */
#define GPIO41_JTAG_M0_TCK \
	BFLB_PINMUX(41, jtag_m0, tck, periph)

/* gpio41_jtag_d0_tck */
#define GPIO41_JTAG_D0_TCK \
	BFLB_PINMUX(41, jtag_d0, tck, periph)

/* gpio42_spi0_miso */
#define GPIO42_SPI0_MISO \
	BFLB_PINMUX(42, spi0, miso, periph)

/* gpio42_i2s_di */
#define GPIO42_I2S_DI \
	BFLB_PINMUX(42, i2s, di, periph)

/* gpio42_pdm_clk */
#define GPIO42_PDM_CLK \
	BFLB_PINMUX(42, pdm, clk, periph)

/* gpio42_i2c0_scl */
#define GPIO42_I2C0_SCL \
	BFLB_PINMUX(42, i2c0, scl, periph)

/* gpio42_i2c1_scl */
#define GPIO42_I2C1_SCL \
	BFLB_PINMUX(42, i2c1, scl, periph)

/* gpio42_uart0_rts */
#define GPIO42_UART0_RTS \
	BFLB_PINMUX(42, uart0, rts, periph)

/* gpio42_uart0_cts */
#define GPIO42_UART0_CTS \
	BFLB_PINMUX(42, uart0, cts, periph)

/* gpio42_uart0_tx */
#define GPIO42_UART0_TX \
	BFLB_PINMUX(42, uart0, tx, periph)

/* gpio42_uart0_rx */
#define GPIO42_UART0_RX \
	BFLB_PINMUX(42, uart0, rx, periph)

/* gpio42_uart1_rts */
#define GPIO42_UART1_RTS \
	BFLB_PINMUX(42, uart1, rts, periph)

/* gpio42_uart1_cts */
#define GPIO42_UART1_CTS \
	BFLB_PINMUX(42, uart1, cts, periph)

/* gpio42_uart1_tx */
#define GPIO42_UART1_TX \
	BFLB_PINMUX(42, uart1, tx, periph)

/* gpio42_uart1_rx */
#define GPIO42_UART1_RX \
	BFLB_PINMUX(42, uart1, rx, periph)

/* gpio42_uart2_rts */
#define GPIO42_UART2_RTS \
	BFLB_PINMUX(42, uart2, rts, periph)

/* gpio42_uart2_cts */
#define GPIO42_UART2_CTS \
	BFLB_PINMUX(42, uart2, cts, periph)

/* gpio42_uart2_tx */
#define GPIO42_UART2_TX \
	BFLB_PINMUX(42, uart2, tx, periph)

/* gpio42_uart2_rx */
#define GPIO42_UART2_RX \
	BFLB_PINMUX(42, uart2, rx, periph)

/* gpio42_pwm0_ch2p */
#define GPIO42_PWM0_CH2P \
	BFLB_PINMUX(42, pwm0, ch2p, periph)

/* gpio42_pwm1_ch2p */
#define GPIO42_PWM1_CH2P \
	BFLB_PINMUX(42, pwm1, ch2p, periph)

/* gpio42_spi1_miso */
#define GPIO42_SPI1_MISO \
	BFLB_PINMUX(42, spi1, miso, periph)

/* gpio42_i2c2_scl */
#define GPIO42_I2C2_SCL \
	BFLB_PINMUX(42, i2c2, scl, periph)

/* gpio42_i2c3_scl */
#define GPIO42_I2C3_SCL \
	BFLB_PINMUX(42, i2c3, scl, periph)

/* gpio42_jtag_lp_tdo */
#define GPIO42_JTAG_LP_TDO \
	BFLB_PINMUX(42, jtag_lp, tdo, periph)

/* gpio42_jtag_m0_tdo */
#define GPIO42_JTAG_M0_TDO \
	BFLB_PINMUX(42, jtag_m0, tdo, periph)

